zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_power.h"
#include "fsl_modcon.h"
#include "fsl_clock.h"
#if MCUX_POWER_PF9453_SUPPLY
#include "fsl_pf9453.h" /* External VDD_CORE supply (Option D). fsl_power never includes fsl_lpi2c. */
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.power"
#endif

#if MCUX_POWER_PF9453_SUPPLY
/* PF9453 BUCK2 (VDD_CORE) millivolt set-points, mapped from the DCDC VOUT_ADJ codes below. */
#define POWER_PF9453_BUCK2_RUN_HP_MV  (900U) /*!< HP run: 0.9 V. */
#define POWER_PF9453_BUCK2_RUN_LP_MV  (800U) /*!< NP / LP run: 0.8 V. */
#define POWER_PF9453_BUCK2_STANDBY_MV (650U) /*!< Deep-sleep standby: 0.65 V (matches SoC DAC). */
#endif

/* Number of 32-bit words covering all 384 NVIC IRQs and 64 DMA sources. */
#define POWER_IRQ_WAKEUP_MASK_COUNT 12U
#define POWER_DMA_WAKEUP_MASK_COUNT 2U
#define POWER_PDCON_DOMAIN_COUNT    6U /*!< RT2660 PDCON sleep-event flags cover domains 0..5. */

/*
 * Standby configuration constants.
 */
#define POWER_CSRCCFG_STBY_ALL_OFF (0x00000000u)       /*!< Turn off all clock sources in standby */
#define POWER_CSRCCFG_STBY_ALL_ON  ((1UL << 9U) - 1UL) /*!< Keep all clock sources enabled in standby */

/*
 * RCGCFG_STBY helper macro - builds the 8-bit root-clock enable word from
 * the individual bool fields in power_sleep_config_t / power_deep_sleep_config_t.
 * RCGCFG_STBY is active-high: bit=1 keeps the root clock enabled in standby.
 */
#define POWER_BUILD_RCGCFG_STBY(cfg)                                                                          \
    (((cfg)->enableComputeRootClock ? (1UL << 0U) : 0UL) | ((cfg)->enableMainRootClock ? (1UL << 1U) : 0UL) | \
     ((cfg)->enableWakeRootClock ? (1UL << 2U) : 0UL) | ((cfg)->enableCommRootClock ? (1UL << 3U) : 0UL) |    \
     ((cfg)->enableMediaRootClock ? (1UL << 4U) : 0UL) | ((cfg)->enableAudioRootClock ? (1UL << 5U) : 0UL) |  \
     ((cfg)->enableWake1MRootClock ? (1UL << 6U) : 0UL) | ((cfg)->enableWake2MRootClock ? (1UL << 7U) : 0UL))

/* CSRCCFG_STBY is active-high for standby source retention: bit=1 keeps the
 * corresponding clock source enabled in standby; bit=0 lets it turn off. */
#define POWER_BUILD_CSRCCFG_STBY(cfg)                                                           \
    (((cfg)->enableLdoa0V8ClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_LDOA_0V8) : 0UL) | \
     ((cfg)->enableFro192MClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_FRO192M) : 0UL) |  \
     ((cfg)->enableFro12MClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_FRO12M) : 0UL) |    \
     ((cfg)->enableMainPllClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_MAINPLL) : 0UL) |  \
     ((cfg)->enableCorePllClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_COREPLL) : 0UL) |  \
     ((cfg)->enableSysPllClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_SYSPLL) : 0UL) |    \
     ((cfg)->enableLdoq0V8ClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_LDOQ_0V8) : 0UL) | \
     ((cfg)->enableSxoscClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_SXOSC) : 0UL) |      \
     ((cfg)->enableFro12MLpClockSource ? (1UL << (uint32_t)kPOWER_ClockSource_FRO12M_LP) : 0UL))

/* RT2660 MEMCON layout constants. */
#define POWER_MEMCON_MAX_BLOCKS_PER_SLICE     12U /*!< Maximum blocks configurable per MEMCON slice */
#define POWER_MEMCON_OCRAM0_SLICE_IDX         2U  /*!< OCRAM0 resides in MEMCON slice 2 */
#define POWER_MEMCON_OCRAM0_DS_BLOCK_COUNT    9U  /*!< OCRAM0 blocks configured for Deep Sleep retention */
#define POWER_MEMCON_OCRAM0_MAX_RETAIN_BLOCKS 8U  /*!< Max blocks for PD retention (64 KB / 8 KB each) */
#define POWER_MEMCON_OCRAM0_PKC_BLOCK_IDX     11U /*!< PKC RAM block index within OCRAM0 slice */
#define POWER_MEMCON_OCRAM0_LLC_BLOCK_IDX     8U  /*!< LLC cache block index within OCRAM0 slice (S2 B8) */
#define POWER_MEMCON_AUDIO8KB_BLOCK_IDX       10U /*!< Audio SRAM 8KB block index within OCRAM0 slice (S2 B10) */

/* PMUCFG.pmuMode bitfield values (RT2660 PMU mode encoding). */
#define POWER_PMU_MODE_LP  2U /*!< Low Power (ZBB, 0.8 V DCDC) */
#define POWER_PMU_MODE_RET 3U /*!< Retention (DCDC off) */
#define POWER_PMU_MODE_BB  4U /*!< Body Bias mode (Deep Power Down) */

/* PMUCFG LDO mode field encoding (shared by ldo0V8Mode, ldo1V8Mode, ldoVdda1V8Mode). */
#define POWER_LDO_MODE_LP 2U /*!< LDO Low Power mode */

/*
 * Body-bias reference values from the verification-team sequence
 * (rt2660_bodybias_configuration.drawio).
 *
 * IMPORTANT: these are temporary reference trim values until OTP/PMU
 * characterization data is available through the production trim flow.
 * fsl_power only uses ZBB and full FBB (N-well + P-well); it does not use
 * P-well-only, N-well-only, Hi-Z, standby, or VDD-tracking body-bias modes.
 */
#define POWER_BODYBIAS_FBB_NWELL_VOL_SEL (0x18U) // 1200mV
#define POWER_BODYBIAS_FBB_PWELL_VOL_SEL (0x24U) // 1800mV

/* OCRAM0 block granularity used for retention sizing. */
#define POWER_OCRAM0_BLOCK_SIZE_KB 8U /*!< Each MEMCON OCRAM0 block covers 8 KB */

/* POWERCON GPR_COLD_0 bit 0 is a force-alive override for MAIN-domain TCM.
 * 1 = keep the MAIN-domain TCM powered; 0 = allow the configured low-power
 * sequence to power the TCM down.  Clear before deep low-power entry so the
 * low-power sequence is not blocked by a stale retention override while keeping
 * all other cold-GPR application bits intact. */
#define POWER_GPR_COLD0_MAIN_TCM_FORCE_ALIVE_MASK (1UL << 0U)

/* Root clocks that must remain enabled during Power Down standby:
 * bit 7 = WAKE_2M, bit 6 = WAKE_1M, bit 2 = WAKE_SS, bit 1 = MAIN_SS.
 * MAIN_SS is intentionally kept on because wakeup from Power Down resets the
 * system and the reset flow reloads OTP trim values; OTP needs a MAIN clock. */
#define POWER_RCGCFG_STBY_POWERDOWN_REQUIRED                                                               \
    ((1UL << (uint32_t)kPOWER_RootClock_WAKE_SS_2MHz) | (1UL << (uint32_t)kPOWER_RootClock_WAKE_SS_1MHz) | \
     (1UL << (uint32_t)kPOWER_RootClock_WAKE_SS) | (1UL << (uint32_t)kPOWER_RootClock_MAIN_SS))

/* Root clocks required for Deep Sleep wakeup detection. */
#define POWER_RCGCFG_STBY_DEEPSLEEP_REQUIRED \
    ((1UL << (uint32_t)kPOWER_RootClock_WAKE_SS_2MHz) | (1UL << (uint32_t)kPOWER_RootClock_WAKE_SS_1MHz))

