zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
/* VDD_CORE set-point codes. These are DCDC VOUT_ADJ codes (VOUT = 0.225 V + N x 0.025 V,
 * with N=0 a special case = 0.8 V). In active run modes the voltage is applied through the
 * DCDC via PMU_ConfigDcdc(); PMUCFG_ACTIVE.coreLvl alone does not move the rail and is only
 * kept consistent with the applied VOUT_ADJ. In standby the same codes drive the PMU DAC. */
#define POWER_PMUCFG_CORELEVEL_090V 0x1BU /*!< 0.9 V (VOUT_ADJ=27) - HP run mode. */
#define POWER_PMUCFG_CORELEVEL_080V 0U    /*!< 0.8 V (VOUT_ADJ=0) - NP / LP run mode. */
#define POWER_PMUCFG_CORELEVEL_065V 17U   /*!< 0.65 V - Deep Sleep standby (0.225 + 17 x 0.025). */

/* Core-frequency classification thresholds (Hz) for POWER_GetCurrentRunMode(). Margins are
 * deliberate: Normal Run cannot always be divided to exactly 800 MHz (typically ~792 MHz),
 * and LP is ~600 MHz.  The public power_run_mode_t enum is defined in fsl_power.h. */
#define POWER_RUNMODE_HP_FREQ_THRESHOLD_HZ (900000000U) /*!< >= 900 MHz -> HP (~1 GHz). */
#define POWER_RUNMODE_NP_FREQ_THRESHOLD_HZ \
    (700000000U) /*!< >= 700 MHz -> Normal (~792/800 MHz); below -> LP (~600 MHz). */

/*
 * MEMCON slice indices for each power domain's TCM memories.
 * Derived from power_memory_t encoding: (slice << 8) | block.
 */
#define POWER_CPU_TCM_SLICES \
    {kPOWER_Mem_CpuICache, kPOWER_Mem_CpuDCacheData, kPOWER_Mem_CpuITCM, kPOWER_Mem_CpuDTCM, kPOWER_Mem_CpuDCacheTag}
#define POWER_NPU_TCM_SLICES   {kPOWER_Mem_NpuWeightCache, kPOWER_Mem_NpuResultBuffers}
#define POWER_COMM_TCM_SLICES  {kPOWER_Mem_CommShared, kPOWER_Mem_CommType2}
#define POWER_MEDIA_TCM_SLICES {kPOWER_Mem_MediaShared}

/* PMU standby word for Power Down: pmuMode=RET, DCDC off, all LDOs off. */
#define POWER_PMU_STATE_PD_WORD                          \
    ((power_pmu_state_t){.dcdcMode       = 0U,           \
                         .ldo0V8Mode     = 2U,           \
                         .ldo1V8Mode     = 0U,           \
                         .ldoVdda1V8Mode = 0U,           \
                         .dcdcOffPmuRet  = 1U,           \
                         .coreLvl        = 0U,           \
                         .pmuMode        = POWER_PMU_MODE_RET}) \
        .word

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*
 * Driver-private SW wakeup state - one shadow mask per CMC wakeup register array.
 * Polarity: 0 = wakeup enabled, 1 = masked (matches hardware register polarity).
 * All sources start masked (all bits = 1) and are written to hardware inside
 * POWER_ApplyWakeupSources() before every POWER_Enter*() call.
 *
 * RT2660 CMC routing:
 *   s_irqWakeupMask[]      -> CMC0 IRQ_WAKEUP_MASK  (CPU / M85 core, any NVIC interrupt)
 *   s_mainDmaWakeupMask[]  -> CMC1 DMA_WAKEUP_MASK  (MAIN domain DMA wakeup source indices 0-63)
 *   s_wakeDmaWakeupMask[]  -> CMC2 DMA_WAKEUP_MASK  (WAKE domain DMA wakeup source indices 31-43)
 */
static uint32_t s_irqWakeupMask[POWER_IRQ_WAKEUP_MASK_COUNT];
static uint32_t s_mainDmaWakeupMask[POWER_DMA_WAKEUP_MASK_COUNT];
static uint32_t s_wakeDmaWakeupMask[POWER_DMA_WAKEUP_MASK_COUNT];

/* Four RT2660 SW-controllable power domains (PD_CPU/NPU/COMM/MEDIA). */
static const uint8_t s_powerDomains[] = {
    (uint8_t)kPOWER_DomainCpu,
    (uint8_t)kPOWER_DomainNpu,
    (uint8_t)kPOWER_DomainComm,
    (uint8_t)kPOWER_DomainMedia,
};

/*
 * CSSI/ELS LP handshake bypass flag.
 *
 * Default: true (bypass enabled) - CSSI firmware is not yet available for early
 * bring-up.  Set to false via POWER_SetCssiLpHandshakeBypass() when CSSI firmware
 * is ready for production validation.
 *
 * TEST ONLY: this bypass MUST be disabled before production use.
 */
static bool s_cssiBypass = true;

#if MCUX_POWER_PF9453_SUPPLY
/* Internal PF9453 handle, created in POWER_InitExtSupply() from the board-supplied I2C transport. In
 * Option D fsl_power owns the PMIC and drives BUCK2 (VDD_CORE) directly at the run-mode/standby points. */
static pf9453_handle_t s_pmic;
/* Set by POWER_InitExtSupply(). Until then the PMIC handle/transport is not ready, so the run-mode and
 * standby paths skip the BUCK2 write (a run-mode DVS legitimately runs during boot-clock setup, before
 * POWER_InitExtSupply, when the board is ordered per the reference; the PMIC keeps its power-on voltage). */
static bool s_pmicReady = false;
#endif

/*******************************************************************************
 * Private helpers
 ******************************************************************************/

static void POWER_SetBodyBiasFbbFullConfig(pmu_body_bias_config_t *config);

/*
 * Builds step-mode masks from a power_cmc_step_config_t and applies them to
 * the given CMC instance register block.
 */
static void POWER_ApplyCmcStepConfig(POWERCON_CMC_CTRL_Type *base, const power_cmc_step_config_t *cfg)
{
    /* Map the five CMC step fields to a pointer array for uniform iteration. */
    const power_step_config_t *steps[] = {
        &cfg->busMasterLpcg, &cfg->busSlaveLpcg, &cfg->rootClockGate, &cfg->clockSource, &cfg->powerDomain,
    };
    uint8_t sleepMask   = 0U;
    uint8_t wakeupMask  = 0U;
    uint32_t countValue = 0U;

    /* Build sleep and wakeup count-mode masks; capture the shared countValue. */
    for (uint8_t i = 0U; i < ARRAY_SIZE(steps); i++)
    {
        if (steps[i]->sleepMode == kPOWER_StepModeCount)
        {
            sleepMask |= (uint8_t)((1U << i) & 0xFFU);
            countValue = steps[i]->countValue;
        }
        if (steps[i]->wakeupMode == kPOWER_StepModeCount)
        {
            wakeupMask |= (uint8_t)((1U << i) & 0xFFU);
            countValue = steps[i]->countValue;
        }
    }

    /* Write mode mask; set count value only when at least one step uses count mode. */
    POWERCON_SetCmcStepModeMask(base, sleepMask, wakeupMask);
    if ((sleepMask | wakeupMask) != 0U)
    {
        POWERCON_SetCmcCountValue(base, countValue);
    }
}

/*!
 * brief Flushes the accumulated SW wakeup masks to the CMC0/1/2 hardware registers.
 *
 * Writes accumulated wakeup masks to the three CMC instances according to the
 * RT2660-specific CMC-to-domain routing:
 *   CMC0 <- s_irqWakeupMask     (CPU / M85 core, any NVIC interrupt)
 *   CMC1 <- s_mainDmaWakeupMask (MAIN domain DMA wakeup source indices 0-63)
 *   CMC2 <- s_wakeDmaWakeupMask (WAKE domain DMA wakeup source indices 31-43)
 *
 * Each CMC receives only its relevant wakeup type; the other register array is
 * written as all-masked so it cannot generate spurious wakeups.
 *
 * Called automatically before every POWER_Enter*() including Power Down (PD_WAKE
 * remains powered in Power Down, so the CMC2 DMA mask is always relevant).  Also
 * public so an application can apply the masks ahead of a bare __WFI() or inspect
 * the CMC registers; the function is idempotent.
 */
void POWER_ApplyWakeupSources(void)
{
    uint32_t allMasked[POWER_IRQ_WAKEUP_MASK_COUNT]; /* large enough for both arrays */
    uint32_t enableMask[POWER_IRQ_WAKEUP_MASK_COUNT];
    uint32_t i;

