zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
    /* CMC0: IRQ wakeup only. */
    for (i = 0U; i < POWER_IRQ_WAKEUP_MASK_COUNT; i++)
    {
        allMasked[i]  = 0xFFFFFFFFU;
        enableMask[i] = ~s_irqWakeupMask[i]; /* 1 = enable for wakeup */
    }
    POWERCON_DisableWakeupIRQ(SYSCON__POWERCON_CMC0_CTRL, allMasked);
    POWERCON_EnableWakeupIRQ(SYSCON__POWERCON_CMC0_CTRL, enableMask);
    /* CMC0 DMA - keep all-masked (no DMA wakeup sources on CPU domain). */
    for (i = 0U; i < POWER_DMA_WAKEUP_MASK_COUNT; i++)
    {
        allMasked[i] = 0xFFFFFFFFU;
    }
    POWERCON_DisableWakeupDMA(SYSCON__POWERCON_CMC0_CTRL, allMasked);

    /* CMC1: MAIN domain DMA wakeup only. */
    for (i = 0U; i < POWER_DMA_WAKEUP_MASK_COUNT; i++)
    {
        allMasked[i]  = 0xFFFFFFFFU;
        enableMask[i] = ~s_mainDmaWakeupMask[i];
    }
    POWERCON_DisableWakeupDMA(SYSCON__POWERCON_CMC1_CTRL, allMasked);
    POWERCON_EnableWakeupDMA(SYSCON__POWERCON_CMC1_CTRL, enableMask);
    /* CMC1 IRQ - keep all-masked. */
    for (i = 0U; i < POWER_IRQ_WAKEUP_MASK_COUNT; i++)
    {
        allMasked[i] = 0xFFFFFFFFU;
    }
    POWERCON_DisableWakeupIRQ(SYSCON__POWERCON_CMC1_CTRL, allMasked);

    /* CMC2: WAKE domain DMA wakeup only (PD_WAKE remains powered in Power Down). */
    for (i = 0U; i < POWER_DMA_WAKEUP_MASK_COUNT; i++)
    {
        allMasked[i]  = 0xFFFFFFFFU;
        enableMask[i] = ~s_wakeDmaWakeupMask[i];
    }
    POWERCON_DisableWakeupDMA(SYSCON__POWERCON_CMC2_CTRL, allMasked);
    POWERCON_EnableWakeupDMA(SYSCON__POWERCON_CMC2_CTRL, enableMask);
    /* CMC2 IRQ - keep all-masked. */
    for (i = 0U; i < POWER_IRQ_WAKEUP_MASK_COUNT; i++)
    {
        allMasked[i] = 0xFFFFFFFFU;
    }
    POWERCON_DisableWakeupIRQ(SYSCON__POWERCON_CMC2_CTRL, allMasked);
}

/*
 * Applies body bias ZBB (disables FBB/NBB before any standby entry).
 */
static void POWER_ApplyZbb(void)
{
    pmu_body_bias_config_t bbCfg;
    PMU_GetDefaultBodyBiasConfig(&bbCfg);
    PMU_ConfigBodyBias(SYSCON__PMU, &bbCfg);
    (void)PMU_ApplyBodyBiasBlocking(SYSCON__PMU);
}

/* Full FBB used by fsl_power: N-well + P-well only. */
static void POWER_SetBodyBiasFbbFullConfig(pmu_body_bias_config_t *config)
{
    assert(config != NULL);

    PMU_GetDefaultBodyBiasConfig(config);
    config->mode        = kPMU_BodyBiasFBBFull;
    config->nwellVolSel = POWER_BODYBIAS_FBB_NWELL_VOL_SEL;
    config->pwellVolSel = POWER_BODYBIAS_FBB_PWELL_VOL_SEL;
}

/*
 * Clears PDCON sleep-event flags before entering a low-power mode so stale
 * PDSEF state from a previous transition cannot be mistaken for this entry.
 * RESETCON sticky reset status is intentionally left to the example/application.
 */
static void POWER_ClearPdsef(void)
{
    for (uint8_t domain = 0U; domain < POWER_PDCON_DOMAIN_COUNT; domain++)
    {
        (void)PDCON_GetAndClearEvent(SYSCON__PDCON, domain, true);
    }
}

/*
 * Allow the low-power sequence to power down MAIN-domain TCM by clearing the
 * GPR_COLD_0 force-alive override. Other GPR_COLD_0 bits are application owned
 * and must be preserved.
 */
static void POWER_ClearMainTcmForceAlive(void)
{
    uint32_t gprCold0 = POWERCON_GetColdGPR(SYSCON__POWERCON_SOC_CTRL, 0U);
    gprCold0 &= ~POWER_GPR_COLD0_MAIN_TCM_FORCE_ALIVE_MASK;
    POWERCON_SetColdGPR(SYSCON__POWERCON_SOC_CTRL, 0U, gprCold0);
}

/*
 * Configures MEMCON sleep-mode power state for a list of memory identifiers.
 */
static void POWER_SetMemSlicesSleepMode(memcon_power_mode_t mode, const power_memory_t *mems, uint32_t count)
{
    MEMCON_SLICE_Type *const sliceBases[] = MEMCON_SLICE_BASE_PTRS;
    for (uint32_t i = 0U; i < count; i++)
    {
        uint8_t sliceIdx = (uint8_t)((uint32_t)mems[i] >> 8U);
        uint8_t blockIdx = (uint8_t)((uint32_t)mems[i] & 0xFFU);
        MEMCON_SLICE_SetSleepBlockMode(sliceBases[sliceIdx], blockIdx, mode);
    }
}

/*******************************************************************************
 * Public API
 ******************************************************************************/

/*!
 * brief Fills power_policy_config_t with hardware reset defaults.
 *
 * All CMC and SSC steps set to Handshake mode; CSSI enabled and unlocked;
 * handshakeRouting set to NULL (POWER_SetPolicy will apply POR-default routing).
 */
void POWER_GetDefaultPolicyConfig(power_policy_config_t *config)
{
    assert(config != NULL);

    /* CMC/SSC step modes: hardware reset default is Handshake for all steps.
     * countValue reset = 0 (only relevant when mode = kPOWER_StepModeCount). */
    const power_step_config_t kStepDefault = {
        .sleepMode  = kPOWER_StepModeHandshake,
        .wakeupMode = kPOWER_StepModeHandshake,
        .countValue = 0U,
    };
    const power_cmc_step_config_t kCmcStepDefault = {
        .busMasterLpcg = kStepDefault,
        .busSlaveLpcg  = kStepDefault,
        .rootClockGate = kStepDefault,
        .clockSource   = kStepDefault,
        .powerDomain   = kStepDefault,
    };
    config->cmcCpu  = kCmcStepDefault;
    config->cmcMain = kCmcStepDefault;
    config->cmcWake = kCmcStepDefault;
    config->sscPmu  = kStepDefault;
    config->sscPmic = kStepDefault;

    /* handshakeRouting == NULL: POWER_SetPolicy will apply POR-default HSK_SEL and HSKCTRL. */
    config->handshakeRouting = NULL;
}

/*!
 * brief Fill power_handshake_routing_config_t with POR-default routing values.
 */
void POWER_GetDefaultHandshakeRoutingConfig(power_handshake_routing_config_t *config)
{
    assert(config != NULL);

    config->rcgcfgHskSel   = 0x77777777UL;
    config->csrccfgHskSel  = 0x77777777UL;
    config->csrccfgHskSel1 = 0x7UL;
    for (uint8_t i = 0U; i < 6U; i++)
    {
        config->domainHsk[i] = kPDCON_HandshakeAll;
    }
}

/*!
 * brief Apply or override the SoC handshake routing configuration.
 */
void POWER_SetHandshakeRouting(const power_handshake_routing_config_t *config)
{
    assert(config != NULL);

    powercon_topology_config_t pcTopo = {
        .rcgcfgHskSel   = config->rcgcfgHskSel,
        .csrccfgHskSel  = config->csrccfgHskSel,
        .csrccfgHskSel1 = config->csrccfgHskSel1,
    };
    POWERCON_SetTopologyConfig(SYSCON__POWERCON_SOC_CTRL, &pcTopo);

    for (uint8_t i = 0U; i < 6U; i++)
    {
        PDCON_SetHandshake(SYSCON__PDCON, i, config->domainHsk[i]);
    }
}

/*!
 * brief Applies the power management policy (active/low-power baseline, NPU/Media/Comm
 *       domain state, active-mode clock sources). Safe to call more than once.
 */
void POWER_SetPolicy(const power_policy_config_t *config)
{
    assert(config != NULL);

    /* 1. Enable POWERCON function clock FIRST (must precede all POWERCON accesses). */
    POWERCON_EnableFunctionClock(SYSCON__POWERCON_SOC_CTRL);

    /* 2. Enable PDCON function clock. */
    PDCON_EnableFunctionClock(SYSCON__PDCON, true);

    /* 3. Apply SoC handshake routing (HSK_SEL routing and PDCON HSKCTRL).
     *    NULL -> apply POR-default values; non-NULL -> apply caller-supplied config. */
    if (config->handshakeRouting != NULL)
    {
        POWER_SetHandshakeRouting(config->handshakeRouting);
    }

