zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
    /* 4. Apply per-CMC step-mode configuration. */
    POWER_ApplyCmcStepConfig(SYSCON__POWERCON_CMC0_CTRL, &config->cmcCpu);
    POWER_ApplyCmcStepConfig(SYSCON__POWERCON_CMC1_CTRL, &config->cmcMain);
    POWER_ApplyCmcStepConfig(SYSCON__POWERCON_CMC2_CTRL, &config->cmcWake);

    /* 6. Build SSC step-mode bitmasks. */
    uint8_t sscSleepMask                  = 0U;
    uint8_t sscWakeupMask                 = 0U;
    uint32_t sscCountValue                = 0U;
    const power_step_config_t *sscSteps[] = {&config->sscPmu, &config->sscPmic};
    for (uint8_t i = 0U; i < ARRAY_SIZE(sscSteps); i++)
    {
        if (sscSteps[i]->sleepMode == kPOWER_StepModeCount)
        {
            sscSleepMask |= (uint8_t)(1U << i);
            sscCountValue = sscSteps[i]->countValue;
        }
        if (sscSteps[i]->wakeupMode == kPOWER_StepModeCount)
        {
            sscWakeupMask |= (uint8_t)(1U << i);
            sscCountValue = sscSteps[i]->countValue;
        }
    }
    POWERCON_EnableSysSleepCtrlStepMode(SYSCON__POWERCON_SYS_SLEEP_CTRL, sscSleepMask, sscWakeupMask);

    if ((sscSleepMask | sscWakeupMask) != 0U)
    {
        /* In case of step-mode count being used, set the SSC count value. */
        POWERCON_SetSysSleepCtrlCountValue(SYSCON__POWERCON_SYS_SLEEP_CTRL, sscCountValue);
    }

    /* 7. Standby gating baseline: XMC_STBY_MASK = 0x07 disables all CMC internal
     *    standby flows while active, so a bare application WFI stays a simple
     *    core WFI. Each POWER_Enter*() programs the mode-specific mask before
     *    its WFI. TRIGGER_SS is set explicitly on all CMCs (silicon default
     *    made deterministic); Sleep entry clears it on CMC0. */
    POWERCON_SetXmcStandbyMask(SYSCON__POWERCON_GLOBAL, 0x07U);
    SYSCON__POWERCON_CMC0_CTRL->CMC_CTRL &= ~(POWERCON_CMC_CTRL_CMC_CTRL_SLEEP_HOLD_EN_MASK);

    /* 8. Configure PDCON trigger mode for the four SW-controllable domains.
     *    Default: HW trigger enabled (CMC drives standby transitions).
     *             SW trigger disabled (enabled transiently in POWER_SetDomainRunMode). */
    for (uint32_t i = 0U; i < ARRAY_SIZE(s_powerDomains); i++)
    {
        PDCON_EnableDomainHwTrigger(SYSCON__PDCON, s_powerDomains[i], true);
        PDCON_EnableDomainSwTrigger(SYSCON__PDCON, s_powerDomains[i], false);
        (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, s_powerDomains[i], kPDCON_EventNoneOrActive);
    }
    /* PD_MAIN (domain 1) is not SW-triggerable and not in s_powerDomains, but it DOES have a
     * PDSLPCFG field. Its low-power event is driver-fixed: NoneOrActive everywhere except
     * Power Down / Deep Power Down (set to PowerOff in those entry paths). Establish the
     * active-mode default here. */
    (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, kPOWER_DomainMain, kPDCON_EventNoneOrActive);

    /* 9. Enable active-mode clock sources. Moved here from POWER_EnterHpRun/NormalRun/LpRun
     *     (was duplicated identically in all three) -- those functions are voltage/frequency
     *     only now. */
    for (uint8_t i = 0U; i <= 8U; i++)
    {
        POWERCON_EnableClockSourceInActiveMode(SYSCON__POWERCON_SOC_CTRL, i);
    }

    /* 10. Bring the NPU/Media/Comm domains active, if not already (idempotent -- a domain
     *     already at kPDCON_EventNoneOrActive is not re-triggered). Moved here from
     *     POWER_EnterHpRun/NormalRun/LpRun for the same reason as step 9.
     *
     *     Must come BEFORE step 11 (MEMCON slice SW-trigger): each MEMCON slice's memory
     *     macros sit inside a specific power domain (S6/S7 -> NPU, S9 -> Media, S10/S11 ->
     *     Comm), so touching those slices' MDCTRL/RUNCFG or issuing a SWTRG before the
     *     hosting domain is active either wedges the MEMCON SWTRG self-clear busy-wait or
     *     leaves stale state that only surfaces later as a PDCON_SoftwareTrigger() hang on
     *     Deep Power Down entry/exit (no timeout in this build). */
    static const power_domain_t kActiveDomains[] = {kPOWER_DomainNpu, kPOWER_DomainMedia, kPOWER_DomainComm};
    for (uint8_t i = 0U; i < ARRAY_SIZE(kActiveDomains); i++)
    {
        if (PDCON_GetDomainState(SYSCON__PDCON, (uint8_t)kActiveDomains[i]) != kPDCON_EventNoneOrActive)
        {
            (void)POWER_SetDomainRunMode(kActiveDomains[i], kPDCON_EventNoneOrActive);
        }
    }

    /* 11. Enable MEMCON function clock; set all slices to HW-trigger mode with all
     *    blocks in NormalPower (Active) active state.  SLPCFG (standby registers)
     *    are NOT written here - they are configured only at standby entry.
     *    Order-dependent on step 10 (see step 10 comment). */
    MEMCON_GLOBAL_EnableFunctionClock(SYSCON__MEMCON_GLOBAL, true);
    MEMCON_SLICE_Type *const sliceBases[] = MEMCON_SLICE_BASE_PTRS;
    for (uint32_t i = 0U; i < ARRAY_SIZE(sliceBases); i++)
    {
        /* Write RUNCFG = Active for every block (hardware reset default made explicit;
         * hardware applies this on wakeup from standby - no SW restore needed). */
        MEMCON_SLICE_SetTriggerMode(sliceBases[i], kMEMCON_TriggerSoftware);
        for (uint8_t blk = 0U; blk < POWER_MEMCON_MAX_BLOCKS_PER_SLICE; blk++)
        {
            MEMCON_SLICE_SetActiveBlockMode(sliceBases[i], blk, kMEMCON_PowerModeActive);
        }
        MEMCON_SLICE_SoftwareTrigger(sliceBases[i]);
        /* HW-trigger mode: CMC/SSC drives standby transitions. */
        MEMCON_SLICE_SetTriggerMode(sliceBases[i], kMEMCON_TriggerHardware);
    }

    /* 12. Initialise SW wakeup state: mask all sources. */
    (void)memset(s_irqWakeupMask, 0xFF, sizeof(s_irqWakeupMask));
    (void)memset(s_mainDmaWakeupMask, 0xFF, sizeof(s_mainDmaWakeupMask));
    (void)memset(s_wakeDmaWakeupMask, 0xFF, sizeof(s_wakeDmaWakeupMask));
}

#if MCUX_POWER_PF9453_SUPPLY
void POWER_InitExtSupply(const power_ext_supply_config_t *config)
{
    assert(config != NULL);
    assert(config->I2C_SendFunc != NULL);
    assert(config->I2C_ReceiveFunc != NULL);

    pf9453_config_t pmicConfig;
    pf9453_buck2_config_t buck2Config;

    /* Create the PMIC handle from the board-supplied I2C transport. */
    pmicConfig.I2C_SendFunc    = config->I2C_SendFunc;
    pmicConfig.I2C_ReceiveFunc = config->I2C_ReceiveFunc;
    pmicConfig.slaveAddress    = config->slaveAddress;
    PF9453_CreateHandle(&s_pmic, &pmicConfig);

