zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
    /* One-shot BUCK2 bring-up: enable in ACTIVE/STANDBY, initial run voltage (HP 0.9 V so the boot
     * ramp to HP has adequate VDD_CORE), standby voltage, DVS ramp. Run-mode DVS and standby-target
     * changes are then handled at the transition points. */
    buck2Config.runMillivolt     = POWER_PF9453_BUCK2_RUN_HP_MV;
    buck2Config.standbyMillivolt = POWER_PF9453_BUCK2_STANDBY_MV;
    buck2Config.enableMode       = kPF9453_EnableOnActiveStandby; /* B2_ENMODE = 10. */
    buck2Config.forcePwm         = false;
    buck2Config.activeDischarge  = false;
    buck2Config.dvsRamp          = kPF9453_Buck2Ramp_25mVPer2us; /* reset default. */
    (void)PF9453_ConfigBuck2(&s_pmic, &buck2Config);

    /* Arm the ready flag: subsequent run-mode DVS / standby-target changes now drive the PMIC. */
    s_pmicReady = true;
}
#endif /* MCUX_POWER_PF9453_SUPPLY */

/*!
 * brief Accumulates a wakeup source into SW state.
 *
 * Decodes the opaque power_wakeup_source_t encoding:
 *   bits[31:28] = 0x0 -> IRQ (CMC0),  index = bits[8:0]  (0-383)
 *   bits[31:28] = 0x1 -> MAIN DMA (CMC1), index = bits[5:0]  (0-63)
 *   bits[31:28] = 0x2 -> WAKE DMA (CMC2), index = bits[5:0]  (0-63)
 *
 * Inverted polarity: clear the bit to enable wakeup (matches hardware register).
 */
void POWER_EnableWakeupSource(power_wakeup_source_t source)
{
    uint32_t type  = (source >> 28U) & 0xFU;
    uint32_t index = source & 0x1FFU; /* 9-bit max for IRQ index */

    switch (type)
    {
        case 0x0U: /* IRQ -> CMC0 */
            if (index < ((uint32_t)POWER_IRQ_WAKEUP_MASK_COUNT * 32U))
            {
                s_irqWakeupMask[index / 32U] &= ~(1UL << (index % 32U));
            }
            break;
        case 0x1U:                  /* MAIN domain DMA -> CMC1 */
            index = source & 0x3FU; /* 6-bit DMA index */
            if (index < ((uint32_t)POWER_DMA_WAKEUP_MASK_COUNT * 32U))
            {
                s_mainDmaWakeupMask[index / 32U] &= ~(1UL << (index % 32U));
            }
            break;
        case 0x2U: /* WAKE domain DMA -> CMC2 */
            index = source & 0x3FU;
            if (index < ((uint32_t)POWER_DMA_WAKEUP_MASK_COUNT * 32U))
            {
                s_wakeDmaWakeupMask[index / 32U] &= ~(1UL << (index % 32U));
            }
            break;
        default:
            /* Unknown source type - no action. */
            break;
    }
}

/*!
 * brief Removes a wakeup source from SW state.
 *
 * Same opaque encoding as POWER_EnableWakeupSource.
 * Sets the bit to mask the source (inverted polarity).
 */
void POWER_DisableWakeupSource(power_wakeup_source_t source)
{
    uint32_t type  = (source >> 28U) & 0xFU;
    uint32_t index = source & 0x1FFU;

    switch (type)
    {
        case 0x0U: /* IRQ -> CMC0 */
            if (index < ((uint32_t)POWER_IRQ_WAKEUP_MASK_COUNT * 32U))
            {
                s_irqWakeupMask[index / 32U] |= (1UL << (index % 32U));
            }
            break;
        case 0x1U: /* MAIN domain DMA -> CMC1 */
            index = source & 0x3FU;
            if (index < ((uint32_t)POWER_DMA_WAKEUP_MASK_COUNT * 32U))
            {
                s_mainDmaWakeupMask[index / 32U] |= (1UL << (index % 32U));
            }
            break;
        case 0x2U: /* WAKE domain DMA -> CMC2 */
            index = source & 0x3FU;
            if (index < ((uint32_t)POWER_DMA_WAKEUP_MASK_COUNT * 32U))
            {
                s_wakeDmaWakeupMask[index / 32U] |= (1UL << (index % 32U));
            }
            break;
        default:
            /* Unknown source type - no action. */
            break;
    }
}

/*!
 * brief Masks all accumulated wakeup sources.
 *
 * Resets all three CMC shadow arrays to all-masked (0xFF = all sources masked).
 */
void POWER_ClearAllWakeupSources(void)
{
    (void)memset(s_irqWakeupMask, 0xFF, sizeof(s_irqWakeupMask));
    (void)memset(s_mainDmaWakeupMask, 0xFF, sizeof(s_mainDmaWakeupMask));
    (void)memset(s_wakeDmaWakeupMask, 0xFF, sizeof(s_wakeDmaWakeupMask));
}

/*
 * Media MIPI CSI/DSI PHY 0.8 V supply, controlled by WAKE_MODCON MIPI_0V8_CFG
 * (PWR_EN bit 0: power switch; DATA_EN bit 1: data isolation).
 * The PHY must never be powered while PD_MEDIA is unpowered, and must be isolated
 * before the domain loses power.
 */
static void POWER_MediaMipiPhyPowerOff(void)
{
    uint32_t cfg = MODCON_GetCFG((uint32_t)kModCon_WAKE_MIPI_0V8, 0U);

    /* Isolate first (DATA_EN=0), then switch the PHY supply off (PWR_EN=0). */
    cfg &= ~MODCON_CFG_DATA_EN_MASK;
    MODCON_SetCFG((uint32_t)kModCon_WAKE_MIPI_0V8, 0U, cfg);
    cfg &= ~MODCON_CFG_PWR_EN_MASK;
    MODCON_SetCFG((uint32_t)kModCon_WAKE_MIPI_0V8, 0U, cfg);
}

static void POWER_MediaMipiPhyPowerOn(void)
{
    uint32_t cfg = MODCON_GetCFG((uint32_t)kModCon_WAKE_MIPI_0V8, 0U);

    /* Ensure isolated/off, switch the PHY supply on (PWR_EN=1), then de-isolate (DATA_EN=1). */
    cfg &= ~(MODCON_CFG_DATA_EN_MASK | MODCON_CFG_PWR_EN_MASK);
    MODCON_SetCFG((uint32_t)kModCon_WAKE_MIPI_0V8, 0U, cfg);
    cfg |= MODCON_CFG_PWR_EN_MASK;
    MODCON_SetCFG((uint32_t)kModCon_WAKE_MIPI_0V8, 0U, cfg);
    cfg |= MODCON_CFG_DATA_EN_MASK;
    MODCON_SetCFG((uint32_t)kModCon_WAKE_MIPI_0V8, 0U, cfg);
}

/*!
 * brief Software-triggered power domain state change.
 */
status_t POWER_SetDomainRunMode(power_domain_t domain, pdcon_event_t event)
{
    status_t status;

    /* For PD_MEDIA, isolate and power off the MIPI PHY supply BEFORE the domain loses power. */
    if ((domain == kPOWER_DomainMedia) && (event == kPDCON_EventPowerOff))
    {
        POWER_MediaMipiPhyPowerOff();
    }

    /* SW trigger must be enabled before PDCON_SoftwareTrigger() will fire. */
    PDCON_EnableDomainSwTrigger(SYSCON__PDCON, (uint8_t)domain, true);

    status = PDCON_SetEventInActiveMode(SYSCON__PDCON, (uint8_t)domain, event);
    if (status != kStatus_Success)
    {
        /* Disable SW trigger before returning on error. */
        PDCON_EnableDomainSwTrigger(SYSCON__PDCON, (uint8_t)domain, false);
        return status;
    }

    status = PDCON_SoftwareTrigger(SYSCON__PDCON, (uint8_t)domain);

    /* Always disable SW trigger after attempt; HW trigger is the standby-safe default. */
    PDCON_EnableDomainSwTrigger(SYSCON__PDCON, (uint8_t)domain, false);

