zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
    /* For PD_MEDIA, restore the MIPI PHY supply AFTER the domain is powered on. */
    if ((domain == kPOWER_DomainMedia) && (event == kPDCON_EventNoneOrActive) && (status == kStatus_Success))
    {
        POWER_MediaMipiPhyPowerOn();
    }

    return status;
}

/*!
 * brief Set SRAM block active-mode power state and apply immediately.
 */
status_t POWER_SetMemoryRunMode(power_memory_t mem, memcon_power_mode_t mode)
{
    MEMCON_SLICE_Type *const sliceBases[] = MEMCON_SLICE_BASE_PTRS;
    uint8_t sliceIdx                      = (uint8_t)((uint32_t)mem >> 8U);
    uint8_t blockIdx                      = (uint8_t)((uint32_t)mem & 0xFFU);

    /* Switch to SW trigger to apply the change immediately, then restore HW trigger
     * so CMC/SSC remains in control of standby transitions. */
    MEMCON_SLICE_SetTriggerMode(sliceBases[sliceIdx], kMEMCON_TriggerSoftware);
    MEMCON_SLICE_SetActiveBlockMode(sliceBases[sliceIdx], blockIdx, mode);
    MEMCON_SLICE_SoftwareTrigger(sliceBases[sliceIdx]);
    MEMCON_SLICE_SetTriggerMode(sliceBases[sliceIdx], kMEMCON_TriggerHardware);
    return kStatus_Success;
}

/*!
 * brief Enable a subsystem root clock during active mode.
 *
 * Clears the bit in RCGCFG_ACTIVE (active-low gate: 0b=enables, 1b=disables root clock).
 * Direct register write - no P-Channel trigger required.
 */
void POWER_EnableRunRootClock(power_root_clock_t ss)
{
    POWERCON_EnableRootClockInActiveMode(SYSCON__POWERCON_SOC_CTRL, (uint8_t)ss);
}

/*!
 * brief Disable a subsystem root clock during active mode.
 *
 * Sets the bit in RCGCFG_ACTIVE (active-low gate: 0b=enables, 1b=disables root clock).
 * Direct register write - no P-Channel trigger required.
 */
void POWER_DisableRunRootClock(power_root_clock_t ss)
{
    POWERCON_DisableRootClockInActiveMode(SYSCON__POWERCON_SOC_CTRL, (uint8_t)ss);
}

/*!
 * brief Enable a clock source during active mode via POWERCON P-Channel.
 *
 * Sets the bit in CSRCCFG_ACTIVE (1b=enables, 0b=disables clock source).
 * Requires POWERCON SOC P-Channel update (trigger + poll for completion).
 */
void POWER_EnableRunClockSource(power_clock_source_t src)
{
    POWERCON_EnableClockSourceInActiveMode(SYSCON__POWERCON_SOC_CTRL, (uint8_t)src);
    /* CSRCCFG_ACTIVE is staged; the P-Channel trigger commits it to the PMU. The same
       handshake re-applies the unchanged PMUCFG_ACTIVE, so PMU state is preserved. */
    POWERCON_TriggerSocUpdate(SYSCON__POWERCON_SOC_CTRL);
    while (!POWERCON_IsSocUpdateDone(SYSCON__POWERCON_SOC_CTRL))
    {
    }
}

/*!
 * brief Disable a clock source during active mode via POWERCON P-Channel.
 *
 * Clears the bit in CSRCCFG_ACTIVE (1b=enables, 0b=disables clock source).
 * Caller MUST ensure no active consumer uses this source before calling.
 * Requires POWERCON SOC P-Channel update (trigger + poll for completion).
 */
void POWER_DisableRunClockSource(power_clock_source_t src)
{
    POWERCON_DisableClockSourceInActiveMode(SYSCON__POWERCON_SOC_CTRL, (uint8_t)src);
    /* CSRCCFG_ACTIVE is staged; the P-Channel trigger commits it to the PMU. The same
       handshake re-applies the unchanged PMUCFG_ACTIVE, so PMU state is preserved. */
    POWERCON_TriggerSocUpdate(SYSCON__POWERCON_SOC_CTRL);
    while (!POWERCON_IsSocUpdateDone(SYSCON__POWERCON_SOC_CTRL))
    {
    }
}

void POWER_SetRunRegulatorsConfig(const power_run_regulators_config_t *config)
{
    assert(config != NULL);

    /* Configure each PMU regulator block via the PMU driver layer. */
    PMU_ConfigDcdc(SYSCON__PMU, &config->dcdc);
    PMU_ConfigLdoVdd0V8(SYSCON__PMU, &config->ldo0V8);
    PMU_ConfigLdoVdd1V8(SYSCON__PMU, &config->ldo1V8);
    PMU_ConfigLdoVdda1V8(SYSCON__PMU, &config->ldoVdda);
    PMU_ConfigVddPmu(SYSCON__PMU, &config->vddPmu);

    /* Assemble the PMUCFG_ACTIVE word: sensor enables, HQREF, mode selections, core level. */
    power_pmu_state_t pmucfgActive = {0};
    /* Voltage sensor enables: one bit per regulator rail. */
    pmucfgActive.sensorCore = config->dcdc.sensorEnable ? 1U : 0U;
    pmucfgActive.sensor0V8  = config->ldo0V8.sensorEnable ? 1U : 0U;
    pmucfgActive.sensor1V8  = config->ldo1V8.sensorEnable ? 1U : 0U;
    pmucfgActive.sensorVdda = config->ldoVdda.sensorEnable ? 1U : 0U;
    pmucfgActive.sensorPmu  = config->vddPmu.sensorEnable ? 1U : 0U;
    pmucfgActive.hqref      = 1U; /* High-quality reference always enabled in run modes. */
    /* DCDC operating mode: 1 = PWM, 0 = PFM. */
    pmucfgActive.dcdcMode = (config->dcdc.mode == kPMU_DcdcModePWM) ? 1U : 0U;
    /* LDO operating modes: HP=0, LP=1, bypass=2. */
    pmucfgActive.ldo0V8Mode     = (uint32_t)config->ldo0V8.mode;
    pmucfgActive.ldo1V8Mode     = (uint32_t)config->ldo1V8.mode;
    pmucfgActive.ldoVdda1V8Mode = (uint32_t)config->ldoVdda.mode;
    pmucfgActive.dcdcOffPmuRet  = 0U; /* Keep DCDC active during PMU retention. */
    pmucfgActive.coreLvl        = (uint32_t)config->dcdc.voutAdj & 0x1FU;
    /* Preserve current pmuMode (HP/LP run mode is not changed by this function). */
    {
        power_pmu_state_t curPmuState;
        curPmuState.word     = SYSCON__POWERCON_SOC_CTRL->PMUCFG_ACTIVE;
        pmucfgActive.pmuMode = curPmuState.pmuMode;
    }

    POWERCON_SetPmucfgActive(SYSCON__POWERCON_SOC_CTRL, pmucfgActive.word);
    POWERCON_TriggerSocUpdate(SYSCON__POWERCON_SOC_CTRL);
    while (!POWERCON_IsSocUpdateDone(SYSCON__POWERCON_SOC_CTRL))
    {
    }
}

void POWER_EnableRunPmicStandbyRequest(bool enable)
{
    /* Assert or deassert the PMIC standby request in the active PMIC config register. */
    POWERCON_SetPmiccfgActive(SYSCON__POWERCON_SOC_CTRL, enable ? 1U : 0U);
}

/*!
 * brief Get the current active run mode (classified from the CPU core clock frequency).
 */
power_run_mode_t POWER_GetCurrentRunMode(void)
{
    uint32_t coreFreq = CLOCK_GetRootClockFreq(kCLOCK_Root_CMPT_cpu_clk);
    power_run_mode_t mode;

    if (coreFreq >= POWER_RUNMODE_HP_FREQ_THRESHOLD_HZ)
    {
        mode = kPOWER_RunModeHp;
    }
    else if (coreFreq >= POWER_RUNMODE_NP_FREQ_THRESHOLD_HZ)
    {
        mode = kPOWER_RunModeNormal;
    }
    else
    {
        mode = kPOWER_RunModeLp;
    }

    return mode;
}

/*!
 * brief Apply the active-mode VDD_CORE level by programming the DCDC.
 *
 * The active-mode core voltage is owned by the DCDC BUCK_VDDCORE_VOUT_ADJ register, not by
 * PMUCFG_ACTIVE.coreLvl. Writing coreLvl alone does not move the rail; this function performs
 * the effective change via PMU_ConfigDcdc(). The run-mode DCDC config uses PWM mode with the
 * output-voltage monitor disabled (bring-up); the PWM loop compensation programmed at
 * POWER_SetPolicy() is left untouched. Callers order this relative to the clock callback:
 * raise voltage before speeding the core up, lower voltage only after the core is slowed.
 *
 * param voutAdj VOUT_ADJ code (POWER_PMUCFG_CORELEVEL_090V for HP, _080V for NP/LP).
 */
static void POWER_ApplyRunCoreVoltage(uint8_t voutAdj)
{
#if MCUX_POWER_PF9453_SUPPLY
    /* PMIC path: VDD_CORE is BUCK2. Map the VOUT_ADJ code to millivolts and DVS BUCK2 directly.
     * PF9453_SetBuck2RunVoltage re-issues the regulator unlock and RMW-writes BUCK2OUT internally.
     * The on-chip DCDC is not touched (its VOUT_ADJ path is compiled out below).
     * Skip until POWER_InitExtSupply has created the handle: the boot-clock setup may call a run-mode
     * DVS before the PMIC transport is up, and the PF9453 already holds its power-on voltage then. */
    if (s_pmicReady)
    {
        uint16_t millivolt =
            (voutAdj == POWER_PMUCFG_CORELEVEL_090V) ? POWER_PF9453_BUCK2_RUN_HP_MV : POWER_PF9453_BUCK2_RUN_LP_MV;
        (void)PF9453_SetBuck2RunVoltage(&s_pmic, millivolt);
    }
#else
    pmu_dcdc_config_t dcdcConfig = {
        .mode                 = kPMU_DcdcModePWM,
        .voutAdj              = voutAdj,
        .voutFineAdj          = 0U,
        .ovlVthAdj            = 0U,
        .vsensorVoutAdjEn     = false,
        .bypassEn             = false,
        .ovlPdEn              = false,
        .sensorEnable         = false, /* DCDC output monitor off during bring-up ([hw-defer]). */
        .irqOnVmaxError       = false,
        .irqOnVminError       = false,
        .irqOnClkLost         = false,
        .irqOnUvlo            = false,
        .irqOnOclWarn         = false,
        .warmResetOnVmaxError = false,
        .warmResetOnVminError = false,
        .warmResetOnClkLost   = false,
        .warmResetOnUvlo      = false,
        .warmResetOnOclWarn   = false,
        .coldResetOnVmaxError = false,
        .coldResetOnVminError = false,
        .coldResetOnClkLost   = false,
        .coldResetOnUvlo      = false,
        .coldResetOnOclWarn   = false,
    };
    PMU_ConfigDcdc(SYSCON__PMU, &dcdcConfig);
#endif /* MCUX_POWER_PF9453_SUPPLY */
}

/*!
 * brief Enters HP run mode (VDD_CORE=0.9 V, DCDC PWM, FBB).
 *
 * Determines ordering from the current run mode (detected via the CPU core frequency):
 * if currently LP (ZBB), voltage is raised first, then clockCb is called.
 * If currently FBB (HP/NP), an intermediate ZBB step is applied first (PMU spec §1.7),
 * then clockCb is called, then FBB is re-applied.
 *
 * VDD_CORE is an increase into HP, so the DCDC voltage is raised (PMU_ConfigDcdc) before the
 * clock callback speeds the core up, in both ordering branches.
 */
void POWER_EnterHpRun(power_clock_cb_t clockCb)
{
    pmu_body_bias_config_t bbCfg;
    power_pmu_state_t pmuState;

    /* Read-modify-write: preserve all fields except the three that change per run mode. */
    pmuState.word     = SYSCON__POWERCON_SOC_CTRL->PMUCFG_ACTIVE;
    pmuState.pmuMode  = 0U; /* HP */
    pmuState.dcdcMode = 1U; /* PWM */
    pmuState.coreLvl  = POWER_PMUCFG_CORELEVEL_090V;

    if (POWER_GetCurrentRunMode() == kPOWER_RunModeLp) /* LP (ZBB) -> HP */
    {
        /* LP -> HP: raise voltage first (DCDC + consistent coreLvl), then switch clocks. */
        POWER_ApplyRunCoreVoltage(POWER_PMUCFG_CORELEVEL_090V);
        POWERCON_SetPmucfgActive(SYSCON__POWERCON_SOC_CTRL, pmuState.word);
        POWERCON_TriggerSocUpdate(SYSCON__POWERCON_SOC_CTRL);
        while (!POWERCON_IsSocUpdateDone(SYSCON__POWERCON_SOC_CTRL))
        {
        }
        POWER_SetBodyBiasFbbFullConfig(&bbCfg);
        PMU_ConfigBodyBias(SYSCON__PMU, &bbCfg);
        (void)PMU_ApplyBodyBiasBlocking(SYSCON__PMU);
        if (clockCb != NULL)
        {
            clockCb();
        }
    }
    else
    {
        /* HP/NP -> HP: must transition through ZBB before switching FBB target. */
        PMU_GetDefaultBodyBiasConfig(&bbCfg);
        PMU_ConfigBodyBias(SYSCON__PMU, &bbCfg);
        (void)PMU_ApplyBodyBiasBlocking(SYSCON__PMU);
        /* Increase into HP: raise the DCDC voltage before the core clock speeds up. */
        POWER_ApplyRunCoreVoltage(POWER_PMUCFG_CORELEVEL_090V);
        POWERCON_SetPmucfgActive(SYSCON__POWERCON_SOC_CTRL, pmuState.word);
        POWERCON_TriggerSocUpdate(SYSCON__POWERCON_SOC_CTRL);
        while (!POWERCON_IsSocUpdateDone(SYSCON__POWERCON_SOC_CTRL))
        {
        }
        if (clockCb != NULL)
        {
            clockCb();
        }
        POWER_SetBodyBiasFbbFullConfig(&bbCfg);
        PMU_ConfigBodyBias(SYSCON__PMU, &bbCfg);
        (void)PMU_ApplyBodyBiasBlocking(SYSCON__PMU);
    }
}

/*!
 * brief Enters Normal run mode (VDD_CORE=0.8 V, DCDC PWM, FBB).
 */
void POWER_EnterNormalRun(power_clock_cb_t clockCb)
{
    pmu_body_bias_config_t bbCfg;
    power_pmu_state_t pmuState;

    /* Read-modify-write: preserve all fields except the three that change per run mode. */
    pmuState.word     = SYSCON__POWERCON_SOC_CTRL->PMUCFG_ACTIVE;
    pmuState.pmuMode  = 0U; /* HP/NP share the same pmuMode=0 */
    pmuState.dcdcMode = 1U; /* PWM */
    pmuState.coreLvl  = POWER_PMUCFG_CORELEVEL_080V;

    if (POWER_GetCurrentRunMode() == kPOWER_RunModeLp) /* LP (ZBB) -> NP */
    {
        /* LP -> NP: VDD_CORE is unchanged (both 0.8 V); apply the DCDC level for
         * consistency, then switch body bias and clocks. */
        POWER_ApplyRunCoreVoltage(POWER_PMUCFG_CORELEVEL_080V);
        POWERCON_SetPmucfgActive(SYSCON__POWERCON_SOC_CTRL, pmuState.word);
        POWERCON_TriggerSocUpdate(SYSCON__POWERCON_SOC_CTRL);
        while (!POWERCON_IsSocUpdateDone(SYSCON__POWERCON_SOC_CTRL))
        {
        }
        POWER_SetBodyBiasFbbFullConfig(&bbCfg);
        PMU_ConfigBodyBias(SYSCON__PMU, &bbCfg);
        (void)PMU_ApplyBodyBiasBlocking(SYSCON__PMU);
        if (clockCb != NULL)
        {
            clockCb();
        }
    }
    else
    {
        /* HP/NP -> NP: must transition through ZBB before switching FBB target. */
        PMU_GetDefaultBodyBiasConfig(&bbCfg);
        PMU_ConfigBodyBias(SYSCON__PMU, &bbCfg);
        (void)PMU_ApplyBodyBiasBlocking(SYSCON__PMU);
        /* Decrease from HP (0.9 V) into NP (0.8 V): reduce the core clock first, then
         * lower the DCDC voltage. Applying 0.8 V while still at HP frequency would
         * undervolt the core. */
        if (clockCb != NULL)
        {
            clockCb();
        }
        POWER_ApplyRunCoreVoltage(POWER_PMUCFG_CORELEVEL_080V);
        POWERCON_SetPmucfgActive(SYSCON__POWERCON_SOC_CTRL, pmuState.word);
        POWERCON_TriggerSocUpdate(SYSCON__POWERCON_SOC_CTRL);
        while (!POWERCON_IsSocUpdateDone(SYSCON__POWERCON_SOC_CTRL))
        {
        }
        /* Switch body bias to FBB after clocks are settled at the new voltage. */
        POWER_SetBodyBiasFbbFullConfig(&bbCfg);
        PMU_ConfigBodyBias(SYSCON__PMU, &bbCfg);
        (void)PMU_ApplyBodyBiasBlocking(SYSCON__PMU);
    }
}

/*!
 * brief Enters LP run mode (VDD_CORE=0.8 V, DCDC PWM, ZBB).
 */
void POWER_EnterLpRun(power_clock_cb_t clockCb)
{
    pmu_body_bias_config_t bbCfg;
    power_pmu_state_t pmuState;

    /* Read-modify-write: preserve all fields except the three that change per run mode. */
    pmuState.word     = SYSCON__POWERCON_SOC_CTRL->PMUCFG_ACTIVE;
    pmuState.pmuMode  = 0U; /* LP (ZBB standby path) */
    pmuState.dcdcMode = 1U; /* PWM (V0.9: all active run modes use PWM; PFM is a DS2/DS3-only standby choice) */
    pmuState.coreLvl  = POWER_PMUCFG_CORELEVEL_080V;

