zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
    PMU_GetDefaultBodyBiasConfig(&bbCfg);

    /* HP/NP -> LP: reduce clocks first, then lower voltage. */
    if (clockCb != NULL)
    {
        clockCb();
    }
    PMU_GetDefaultBodyBiasConfig(&bbCfg);
    PMU_ConfigBodyBias(SYSCON__PMU, &bbCfg);
    (void)PMU_ApplyBodyBiasBlocking(SYSCON__PMU);
    /* Clocks are already reduced, so it is safe to lower the DCDC voltage (0.8 V). From HP
     * this is a decrease; from NP the level is unchanged. */
    POWER_ApplyRunCoreVoltage(POWER_PMUCFG_CORELEVEL_080V);
    POWERCON_SetPmucfgActive(SYSCON__POWERCON_SOC_CTRL, pmuState.word);
    POWERCON_TriggerSocUpdate(SYSCON__POWERCON_SOC_CTRL);
    while (!POWERCON_IsSocUpdateDone(SYSCON__POWERCON_SOC_CTRL))
    {
    }
}

/*!
 * brief Set the CSSI/ELS LP handshake bypass flag.
 */
void POWER_SetCssiLpHandshakeBypass(bool bypass)
{
    s_cssiBypass = bypass;
}

/*!
 * brief Perform the CSSI/ELS LP handshake before standby entry.
 *
 * When bypass is disabled (production mode), this function:
 *   1. Sends an LP permission request to CSSI firmware via MU.
 *   2. Waits for CSSI firmware to respond allow/deny via MU reply.
 *   3. If allowed, asserts MAIN__MODCON ELS_LP_HDSK.ELS_LP_REQ to notify
 *      the ELS hardware block that LP entry is imminent.
 *
 * Communication with CSSI uses the Messaging Unit (MU).  The exact MU
 * message protocol will be defined when CSSI firmware is ready.
 *
 * Returns true if LP entry is allowed (or bypass is active),
 * false if CSSI denied the LP request.
 */
static bool POWER_RequestCssiLpEntry(void)
{
    if (s_cssiBypass)
    {
        /*
         * TEST ONLY: CSSI handshake bypassed.
         * CSSI firmware is not yet available for this bring-up phase.
         * Remove this bypass before production validation - call
         * POWER_SetCssiLpHandshakeBypass(false) when CSSI firmware is ready.
         */
        SYSCON__POWERCON_CMC0_CTRL->NON_IRQ_CS &= ~POWERCON_CMC_CTRL_NON_IRQ_CS_CSSI_EN_MASK;
        SYSCON__POWERCON_CMC1_CTRL->NON_IRQ_CS &= ~POWERCON_CMC_CTRL_NON_IRQ_CS_CSSI_EN_MASK;
        SYSCON__POWERCON_CMC2_CTRL->NON_IRQ_CS &= ~POWERCON_CMC_CTRL_NON_IRQ_CS_CSSI_EN_MASK;
        return true;
    }

    /*
     * Production path - CSSI firmware required.
     *
     * Step 1: Send LP request to CSSI via MU and wait for allow/deny response.
     *         Communication protocol (message codes and MU channel assignment)
     *         will be defined when CSSI firmware is available.
     *         TODO: implement MU send + receive when CSSI firmware is ready.
     *
     * Step 2: If CSSI allows LP entry, assert ELS_LP_REQ via MAIN__MODCON
     *         ELS_LP_HDSK register (IP[53].CFG[3], bit 16) to notify the ELS
     *         hardware block.  CSSI then asserts allow_lp to POWERCON.
     *
     * Step 3: If CSSI denies, return false - the caller must not issue WFI.
     */

    /* Placeholder: always allow until MU protocol is finalized. */
    /* TODO: replace with actual MU send/receive and MODCON write. */
    MAIN__MODCON->IP[53U].CFG[3U] |= MODCON_CFG_ELS_LP_REQ_MASK;

    return true; /* TODO: return false if CSSI MU response is deny. */
}

/*!
 * brief Enters Sleep mode and returns on wakeup.
 */
status_t POWER_EnterSleep(const power_sleep_config_t *config)
{
    if (config == NULL)
    {
        return kStatus_InvalidArgument;
    }

    /* 0. CSSI/ELS LP handshake - abort if CSSI denies LP entry. */
    if (!POWER_RequestCssiLpEntry())
    {
        return kStatus_Fail;
    }

    MEMCON_SLICE_Type *const sliceBases[] = MEMCON_SLICE_BASE_PTRS;

    /* 1. Configure MEMCON SLPCFG from config memory fields. */
    /* Slice 0: Wake SRAM (B0). */
    MEMCON_SLICE_SetSleepBlockMode(sliceBases[0U], 0U, config->setWakeSramMode);
    /* Slice 2: OCRAM0 (B0-B7), LLC cache (B8), Audio 8KB (B10). */
    for (uint8_t blk = 0U; blk < POWER_MEMCON_OCRAM0_MAX_RETAIN_BLOCKS; blk++)
    {
        MEMCON_SLICE_SetSleepBlockMode(sliceBases[POWER_MEMCON_OCRAM0_SLICE_IDX], blk, config->setOcramMode);
    }
    MEMCON_SLICE_SetSleepBlockMode(sliceBases[POWER_MEMCON_OCRAM0_SLICE_IDX], POWER_MEMCON_OCRAM0_LLC_BLOCK_IDX,
                                   config->setLlcCacheMode);
    MEMCON_SLICE_SetSleepBlockMode(sliceBases[POWER_MEMCON_OCRAM0_SLICE_IDX], POWER_MEMCON_AUDIO8KB_BLOCK_IDX,
                                   config->setAudio8KbMode);
    /* TCM slices from config. */
    const power_memory_t cpuMems[]   = POWER_CPU_TCM_SLICES;
    const power_memory_t npuMems[]   = POWER_NPU_TCM_SLICES;
    const power_memory_t commMems[]  = POWER_COMM_TCM_SLICES;
    const power_memory_t mediaMems[] = POWER_MEDIA_TCM_SLICES;
    POWER_SetMemSlicesSleepMode(config->setM85TcmMode, cpuMems, ARRAY_SIZE(cpuMems));
    POWER_SetMemSlicesSleepMode(config->setNpuTcmMode, npuMems, ARRAY_SIZE(npuMems));
    POWER_SetMemSlicesSleepMode(config->setCommTcmMode, commMems, ARRAY_SIZE(commMems));
    POWER_SetMemSlicesSleepMode(config->setMediaTcmMode, mediaMems, ARRAY_SIZE(mediaMems));

    /* 2. Ensure all SW-controllable domains use HW trigger (CMC drives standby sequence). */
    for (uint32_t i = 0U; i < ARRAY_SIZE(s_powerDomains); i++)
    {
        PDCON_EnableDomainSwTrigger(SYSCON__PDCON, s_powerDomains[i], false);
    }

    /* 3. Configure PDCON sleep events for each domain (PDSLPCFG standby registers). */
    const pdcon_event_t domainEvents[] = {config->setCpuDomainEvent, config->setNpuDomainEvent,
                                          config->setCommDomainEvent, config->setMediaDomainEvent};
    for (uint32_t i = 0U; i < ARRAY_SIZE(s_powerDomains); i++)
    {
        (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, s_powerDomains[i], domainEvents[i]);
    }
    /* PD_MAIN: fixed NoneOrActive in Sleep (only PD/DPD power it off). */
    (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, kPOWER_DomainMain, kPDCON_EventNoneOrActive);

    /* 4. Build PMUCFG_STBY and CSRCCFG_STBY from config fields. */
    power_pmu_state_t pmucfgStby = {0};
    pmucfgStby.pmuMode           = config->setPmuMode;
    pmucfgStby.dcdcMode          = (config->setDcdcMode == kPMU_DcdcModePWM) ? 1U : 0U;
    pmucfgStby.coreLvl           = config->setCoreLevel;
    pmucfgStby.ldo0V8Mode        = (uint32_t)config->setLdo0V8Mode;
    pmucfgStby.ldo1V8Mode        = (uint32_t)config->setLdo1V8Mode;
    pmucfgStby.ldoVdda1V8Mode    = config->setLdoVdda1V8Mode;
    pmucfgStby.hqref             = config->enableHqref ? 1U : 0U;
    pmucfgStby.sensorTemp        = (config->enableSensors >> 0U) & 1U;
    pmucfgStby.sensor0V8         = (config->enableSensors >> 1U) & 1U;
    pmucfgStby.sensor1V8         = (config->enableSensors >> 2U) & 1U;
    pmucfgStby.sensorVdda        = (config->enableSensors >> 3U) & 1U;
    pmucfgStby.sensorCore        = (config->enableSensors >> 4U) & 1U;
    pmucfgStby.sensorPmu         = (config->enableSensors >> 5U) & 1U;

