zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
    powercon_soc_standby_config_t socCfg;
    socCfg.rcgcfgStby  = POWER_BUILD_RCGCFG_STBY(config);
    socCfg.csrccfgStby = POWER_BUILD_CSRCCFG_STBY(config);
    socCfg.pmucfgStby  = pmucfgStby.word;
    socCfg.pmiccfgStby = 0U;
    POWERCON_SetSocStandbyConfig(SYSCON__POWERCON_SOC_CTRL, &socCfg);

    /* Sleep = CMC0-only internal standby flow, SSC not triggered:
     *  - XMC_STBY_MASK = 0x6: enable CMC0's flow, keep CMC1/CMC2 flows disabled.
     *  - CMC0 TRIGGER_SS = 0: CMC0's standby entry must not trigger the SSC. */
    POWERCON_SetXmcStandbyMask(SYSCON__POWERCON_GLOBAL, 0x6U);
    POWERCON_DisableSystemSleepTrigger(SYSCON__POWERCON_CMC0_CTRL);

    /* 5. Apply accumulated wakeup sources. */
    POWER_ApplyWakeupSources();
    SYSCON__POWERCON_CMC0_CTRL->CMC_CTRL |= (POWERCON_CMC_CTRL_CMC_CTRL_SLEEP_HOLD_EN_MASK);

    /* 6. Execute WFI. WFI is the hardware-triggered low-power entry request. */
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    /* 7. Clear PDCON sleep event flags (W1C).
     *    Prevents stale flags from persisting into the next LP entry. */
    POWER_ClearPdsef();
    SYSCON__POWERCON_CMC0_CTRL->CMC_CTRL &= ~(POWERCON_CMC_CTRL_CMC_CTRL_SLEEP_HOLD_EN_MASK);
    __DSB();
    __WFI();
    __ISB();

    /* Restore the active-mode baseline so a later bare WFI stays a bare WFI. */
    POWERCON_SetXmcStandbyMask(SYSCON__POWERCON_GLOBAL, 0x07U);

    return kStatus_Success;
}

/*!
 * brief Enters Deep Sleep mode and returns on wakeup.
 */
status_t POWER_EnterDeepSleep(const power_deep_sleep_config_t *config)
{
    if (config == NULL)
    {
        return kStatus_InvalidArgument;
    }

    /* 0. CSSI/ELS LP handshake - abort if CSSI denies LP entry. */
    if (!POWER_RequestCssiLpEntry())
    {
        return kStatus_Fail;
    }

    POWER_ClearPdsef();
    POWER_ClearMainTcmForceAlive();
    POWER_ApplyZbb();

    MEMCON_SLICE_Type *const sliceBases[] = MEMCON_SLICE_BASE_PTRS;

    /* 1. Configure MEMCON SLPCFG from config memory fields. */
    /* Slice 0: Wake SRAM (B0). */
    MEMCON_SLICE_SetSleepBlockMode(sliceBases[0U], 0U, config->setWakeSramMode);
    /* Slice 2: OCRAM0 (B0-B7), LLC cache (B8), Audio 8KB (B10). */
    for (uint8_t blk = 0U; blk < POWER_MEMCON_OCRAM0_MAX_RETAIN_BLOCKS; blk++)
    {
        MEMCON_SLICE_SetSleepBlockMode(sliceBases[POWER_MEMCON_OCRAM0_SLICE_IDX], blk, config->setOcramMode);
    }
    MEMCON_SLICE_SetSleepBlockMode(sliceBases[POWER_MEMCON_OCRAM0_SLICE_IDX], POWER_MEMCON_OCRAM0_LLC_BLOCK_IDX,
                                   config->setLlcCacheMode);
    MEMCON_SLICE_SetSleepBlockMode(sliceBases[POWER_MEMCON_OCRAM0_SLICE_IDX], POWER_MEMCON_AUDIO8KB_BLOCK_IDX,
                                   config->setAudio8KbMode);
    /* TCM slices from config. */
    const power_memory_t cpuMems[]   = POWER_CPU_TCM_SLICES;
    const power_memory_t npuMems[]   = POWER_NPU_TCM_SLICES;
    const power_memory_t commMems[]  = POWER_COMM_TCM_SLICES;
    const power_memory_t mediaMems[] = POWER_MEDIA_TCM_SLICES;
    POWER_SetMemSlicesSleepMode(config->setM85TcmMode, cpuMems, ARRAY_SIZE(cpuMems));
    POWER_SetMemSlicesSleepMode(config->setNpuTcmMode, npuMems, ARRAY_SIZE(npuMems));
    POWER_SetMemSlicesSleepMode(config->setCommTcmMode, commMems, ARRAY_SIZE(commMems));
    POWER_SetMemSlicesSleepMode(config->setMediaTcmMode, mediaMems, ARRAY_SIZE(mediaMems));

    /* 2. Ensure HW trigger for all domains (CMC drives standby sequence). */
    for (uint32_t i = 0U; i < ARRAY_SIZE(s_powerDomains); i++)
    {
        PDCON_EnableDomainSwTrigger(SYSCON__PDCON, s_powerDomains[i], false);
    }

    /* 3. Configure PDCON sleep events (PDSLPCFG standby registers only;
     *    PDRUNCFG active registers are NOT modified here). */
    const pdcon_event_t domainEvents[] = {config->setCpuDomainEvent, config->setNpuDomainEvent,
                                          config->setCommDomainEvent, config->setMediaDomainEvent};
    for (uint32_t i = 0U; i < ARRAY_SIZE(s_powerDomains); i++)
    {
        (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, s_powerDomains[i], domainEvents[i]);
    }
    /* PD_MAIN: fixed NoneOrActive in Deep Sleep (only PD/DPD power it off). */
    (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, kPOWER_DomainMain, kPDCON_EventNoneOrActive);

    /* 4. Build PMUCFG_STBY and CSRCCFG_STBY from config fields. */
    power_pmu_state_t pmucfgStby = {0};
    pmucfgStby.pmuMode           = config->setPmuMode;
    pmucfgStby.dcdcMode          = (config->setDcdcMode == kPMU_DcdcModePWM) ? 1U : 0U;
    pmucfgStby.coreLvl           = config->setCoreLevel;
    pmucfgStby.ldo0V8Mode        = (uint32_t)config->setLdo0V8Mode;
    pmucfgStby.ldo1V8Mode        = (uint32_t)config->setLdo1V8Mode;
    pmucfgStby.ldoVdda1V8Mode    = config->setLdoVdda1V8Mode;
    pmucfgStby.hqref             = config->enableHqref ? 1U : 0U;
    pmucfgStby.sensorTemp        = (config->enableSensors >> 0U) & 1U;
    pmucfgStby.sensor0V8         = (config->enableSensors >> 1U) & 1U;
    pmucfgStby.sensor1V8         = (config->enableSensors >> 2U) & 1U;
    pmucfgStby.sensorVdda        = (config->enableSensors >> 3U) & 1U;
    pmucfgStby.sensorCore        = (config->enableSensors >> 4U) & 1U;
    pmucfgStby.sensorPmu         = (config->enableSensors >> 5U) & 1U;

    /* 5. Configure SoC standby for Deep Sleep. */
    powercon_soc_standby_config_t socCfg;
    socCfg.rcgcfgStby  = POWER_BUILD_RCGCFG_STBY(config) | POWER_RCGCFG_STBY_DEEPSLEEP_REQUIRED;
    socCfg.csrccfgStby = POWER_BUILD_CSRCCFG_STBY(config);
    socCfg.pmucfgStby  = pmucfgStby.word;
    socCfg.pmiccfgStby = 0U;
    POWERCON_SetSocStandbyConfig(SYSCON__POWERCON_SOC_CTRL, &socCfg);
    /* Deep Sleep: enable all CMC internal standby flows (XMC_STBY_MASK = 0) and
     * have every CMC trigger the SSC (explicit; also repairs the CMC0 TRIGGER_SS
     * clear left by a previous POWER_EnterSleep). */
    POWERCON_SetXmcStandbyMask(SYSCON__POWERCON_GLOBAL, 0x00U);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC0_CTRL);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC1_CTRL);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC2_CTRL);

    /* 6. Apply accumulated wakeup sources. */
    POWER_ApplyWakeupSources();
    SYSCON__POWERCON_CMC0_CTRL->CMC_CTRL |= (POWERCON_CMC_CTRL_CMC_CTRL_SLEEP_HOLD_EN_MASK);

    /* 6b. If PD_MEDIA will be powered off in standby, isolate and power off the MIPI PHY
     *     supply before WFI so it is never powered while the domain is unpowered. */
    bool restoreMediaMipiPhy = (config->setMediaDomainEvent == kPDCON_EventPowerOff);
    if (restoreMediaMipiPhy)
    {
        POWER_MediaMipiPhyPowerOff();
    }

#if MCUX_POWER_PF9453_SUPPLY
    /* 6c. Select the PMIC STANDBY (not DPSTANDBY) target so BUCK2 stays on and drops to its standby
     *     voltage when POWERCON's sscPmic step asserts PMIC_STBY_REQ. Enable-mode and standby voltage
     *     were already programmed by POWER_InitExtSupply (skip if the PMIC transport is not up). */
    if (s_pmicReady)
    {
        (void)PF9453_SetStandbyTarget(&s_pmic, kPF9453_StandbySbyt);
    }
#endif

    /* 7. Execute WFI. WFI is the hardware-triggered low-power entry request. */
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    __DSB();
    __WFI();
    __ISB();

    /* 8. On return: hardware has already applied PDRUNCFG (PDCON active registers)
     *    and MEMCON RUNCFG.
     *    PLL clock outputs: hardware only re-enables the DIV4 output of MAINPLL
     *    and SYSPLL on wakeup.  All other outputs (DIV5/8/10/20, PFD0/1/2) remain
     *    gated.  The caller must re-enable any required non-DIV4 PLL outputs after
     *    this function returns.  COREPLL frequency is preserved without a reset;
     *    if the CPU was running from COREPLL before entry no clock restoration
     *    is needed for the core. */
    /* Restore the active-mode baseline so a later bare WFI stays a bare WFI. */
    POWERCON_SetXmcStandbyMask(SYSCON__POWERCON_GLOBAL, 0x07U);
    SYSCON__POWERCON_CMC0_CTRL->CMC_CTRL &= ~(POWERCON_CMC_CTRL_CMC_CTRL_SLEEP_HOLD_EN_MASK);

    /* 8b. Deep Sleep wake resumes in place (no reset) and hardware restores PD_MEDIA,
     *     so restore the MIPI PHY supply if it was powered off on entry. */
    if (restoreMediaMipiPhy)
    {
        POWER_MediaMipiPhyPowerOn();
    }

    return kStatus_Success;
}

/*!
 * brief Enters Power Down mode.  Does not return; wakeup triggers PoR.
 */
status_t POWER_EnterPowerDown(const power_down_config_t *config)
{
    assert(config != NULL);

