zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
    /* 0. CSSI/ELS LP handshake - must consent before powering off. */
    if (!POWER_RequestCssiLpEntry())
    {
        return kStatus_Fail;
    }

    POWER_ClearPdsef();
    POWER_ClearMainTcmForceAlive();
    POWER_ApplyZbb();

    MEMCON_SLICE_Type *const sliceBases[] = MEMCON_SLICE_BASE_PTRS;

    /* 1. Configure MEMCON for OCRAM0/PKC retention per RM Table 793.
     *    OCRAM0 = SRAMCTL_0 (Slice 2, Blocks 0-3) + SRAMCTL_1 (Slice 2, B4-5)
     *           + SRAMCTL_2 (Slice 2, B6-7).  Total: 8 blocks = 64 KB max.
     *    retainOcram0KB selects how many 8 KB blocks to retain (0-64 in 8 KB units).
     *    PKC RAM = Slice 2, Block 11 (RM Table 793: ELE PKC RAM). */
    /* Round up retainOcram0KB to 8 KB blocks, clamped to 8 blocks max before cast. */
    uint32_t retainBlocksRaw =
        (config->retainOcram0KB + (POWER_OCRAM0_BLOCK_SIZE_KB - 1U)) / POWER_OCRAM0_BLOCK_SIZE_KB;
    uint8_t retainBlocks = (retainBlocksRaw > POWER_MEMCON_OCRAM0_MAX_RETAIN_BLOCKS) ?
                               (uint8_t)POWER_MEMCON_OCRAM0_MAX_RETAIN_BLOCKS :
                               (uint8_t)retainBlocksRaw;
    for (uint8_t blk = 0U; blk < POWER_MEMCON_MAX_BLOCKS_PER_SLICE; blk++)
    {
        memcon_power_mode_t mode;
        if (blk < retainBlocks)
        {
            mode = kMEMCON_PowerModeRetention; /* OCRAM0 retention */
        }
        else if ((blk == POWER_MEMCON_OCRAM0_LLC_BLOCK_IDX) && config->retainLlcCache)
        {
            mode = kMEMCON_PowerModeRetention; /* LLC cache retention */
        }
        else if ((blk == POWER_MEMCON_AUDIO8KB_BLOCK_IDX) && config->retainAudio8Kb)
        {
            mode = kMEMCON_PowerModeRetention; /* Audio SRAM 8KB retention */
        }
        else if ((blk == POWER_MEMCON_OCRAM0_PKC_BLOCK_IDX) && config->retainPkcMem)
        {
            mode = kMEMCON_PowerModeRetention; /* PKC RAM retention */
        }
        else
        {
            mode = kMEMCON_PowerModePowerDown;
        }
        MEMCON_SLICE_SetSleepBlockMode(sliceBases[POWER_MEMCON_OCRAM0_SLICE_IDX], blk, mode);
    }

    /* All other SRAM slices: power-off in Power Down. */
    for (uint32_t s = 0U; s < ARRAY_SIZE(sliceBases); s++)
    {
        if (s == POWER_MEMCON_OCRAM0_SLICE_IDX)
        {
            continue;
        } /* slice handled above */
        for (uint8_t blk = 0U; blk < POWER_MEMCON_MAX_BLOCKS_PER_SLICE; blk++)
        {
            MEMCON_SLICE_SetSleepBlockMode(sliceBases[s], blk, kMEMCON_PowerModePowerDown);
        }
    }

    /* 2. Ensure HW trigger; configure all domains to power-off in standby. */
    for (uint32_t i = 0U; i < ARRAY_SIZE(s_powerDomains); i++)
    {
        PDCON_EnableDomainSwTrigger(SYSCON__PDCON, s_powerDomains[i], false);
        (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, s_powerDomains[i], kPDCON_EventPowerOff);
    }
    /* PD_MAIN (fixed): powered off in Power Down via its PDSLPCFG event. */
    (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, kPOWER_DomainMain, kPDCON_EventPowerOff);


    /* 3. Configure SoC standby: retain the clocks required by the Power Down reset flow.
     * MAIN domain is powered off directly in Power Down, and CGU is inside MAIN domain,
     * so the driver does not need to micro-manage individual CGU clock-source state here.
     * Keeping all clock sources marked enabled reduces handshake latency during the reset,
     * OTP trim-load, and CGU restore sequence after wakeup. */
    powercon_soc_standby_config_t socCfg;
    socCfg.rcgcfgStby  = POWER_RCGCFG_STBY_POWERDOWN_REQUIRED;
    socCfg.csrccfgStby = POWER_CSRCCFG_STBY_ALL_ON;
    socCfg.pmucfgStby  = POWER_PMU_STATE_PD_WORD;
    socCfg.pmiccfgStby = 0U;
    POWERCON_SetSocStandbyConfig(SYSCON__POWERCON_SOC_CTRL, &socCfg);

    /* Power Down: enable all CMC internal standby flows (XMC_STBY_MASK = 0) and
     * have every CMC trigger the SSC (explicit; also repairs the CMC0 TRIGGER_SS
     * clear left by a previous POWER_EnterSleep). No restore - wakeup is PoR. */
    POWERCON_SetXmcStandbyMask(SYSCON__POWERCON_GLOBAL, 0x00U);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC0_CTRL);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC1_CTRL);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC2_CTRL);

    /* 4. Apply wakeup sources: CMC0 IRQ, CMC1 MAIN DMA, CMC2 WAKE DMA. */
    POWER_ApplyWakeupSources();
    SYSCON__POWERCON_CMC0_CTRL->CMC_CTRL |= (POWERCON_CMC_CTRL_CMC_CTRL_SLEEP_HOLD_EN_MASK);

    /* 4b. PD_MEDIA is powered off in Power Down: isolate and power off the MIPI PHY supply
     *     before WFI. No restore here - wakeup triggers PoR; the post-reset app re-runs the
     *     power-on sequence. */
    POWER_MediaMipiPhyPowerOff();

#if MCUX_POWER_PF9453_SUPPLY
    /* 4c. Select the PMIC DPSTANDBY target so BUCK2 turns OFF when POWERCON's sscPmic step asserts
     *     PMIC_STBY_REQ (Power Down wakeup is a PoR; the PF9453 stays alive on VSYS). Skip if the PMIC
     *     transport is not up (POWER_InitExtSupply not called). */
    if (s_pmicReady)
    {
        (void)PF9453_SetStandbyTarget(&s_pmic, kPF9453_StandbyDeepStby);
    }
#endif

    /* 5. Execute WFI - wakeup triggers PoR; no return. */
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    __DSB();
    __WFI();
    __ISB();

    while (true) /* Safety net - should never reach here. */
    {
    }
}

/*!
 * @brief Power down the VBAT retention SRAM (Deep Power Down 2, no retention).
 *
 * VBAT__SRAM CTRL PWR_MODE [5:2] must not step ACTIVE->SHUTDOWN directly - the RM
 * requires the INTERMEDIATE state in between - so step ACTIVE(6) -> INTERMEDIATE(2)
 * -> SHUTDOWN(0).  For Deep Power Down 1 (retain) the SRAM is left ACTIVE and held
 * by the always-on VBAT domain (VDD_PMU stays on), so this is not called.
 * [hw-defer] pending silicon confirmation of the VBAT SRAM power sequence.
 */
static void POWER_ShutdownVbatSram(void)
{
   uint32_t ctrl = VBAT__SRAM->CTRL & ~(uint32_t)SRAM_CTRL_PWR_MODE_MASK;
   VBAT__SRAM->CTRL = ctrl | SRAM_CTRL_PWR_MODE(2U); /* INTERMEDIATE (INT) */
   VBAT__SRAM->CTRL = 0UL;                          /* SHUTDOWN (SD = 0)  */
}

/*!
 * brief Enters Deep Power Down mode.
 */
status_t POWER_EnterDeepPowerDown(const power_deep_power_down_config_t *config)
{
    assert(config != NULL);

