zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.c
    /* 0. CSSI/ELS LP handshake - must consent before powering off. */
    if (!POWER_RequestCssiLpEntry())
    {
        return kStatus_Fail;
    }

    POWER_ClearPdsef();
    POWER_ClearMainTcmForceAlive();
    POWER_ApplyZbb();

    MEMCON_SLICE_Type *const sliceBases[] = MEMCON_SLICE_BASE_PTRS;

    /* 1. Configure MEMCON: VBAT SRAM follows retainVbatSram. */
    /* VBAT SRAM is in the VBAT domain (not controlled by MEMCON_SLICE here).
     * For MEMCON slices under VDD_MAIN: power down all. */
    for (uint32_t s = 0U; s < ARRAY_SIZE(sliceBases); s++)
    {
        for (uint8_t blk = 0U; blk < POWER_MEMCON_MAX_BLOCKS_PER_SLICE; blk++)
        {
            MEMCON_SLICE_SetSleepBlockMode(sliceBases[s], blk, kMEMCON_PowerModePowerDown);
        }
    }
    /* VBAT retention SRAM: DPD1 (retainVbatSram) leaves it ACTIVE - the always-on
     * VBAT domain holds the contents while VDD_PMU stays on.  DPD2 does not retain,
     * so power the SRAM down (ACT -> INT -> SD) before the PMIC removes VDD_PMU. */
    if (config->retainVbatSram == false)
    {
        POWER_ShutdownVbatSram();
    }

    /* 2. Ensure HW trigger; configure all domains to power-off in standby. */
    for (uint32_t i = 0U; i < ARRAY_SIZE(s_powerDomains); i++)
    {
        PDCON_EnableDomainSwTrigger(SYSCON__PDCON, s_powerDomains[i], false);
        (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, s_powerDomains[i], kPDCON_EventPowerOff);
    }
    /* PD_MAIN (fixed): powered off in Deep Power Down via its PDSLPCFG event. */
    (void)PDCON_SetEventInLowPowerModes(SYSCON__PDCON, kPOWER_DomainMain, kPDCON_EventPowerOff);

    /* 3. Configure SoC standby: all off, PMU to BB mode. */
    power_pmu_state_t dpd_pmucfg = {0};
    dpd_pmucfg.dcdcOffPmuRet     = 1U;                /* DCDC off */
    dpd_pmucfg.pmuMode           = POWER_PMU_MODE_BB; /* BB */

    powercon_soc_standby_config_t socCfg;
    socCfg.rcgcfgStby = 0x00U; /* All root clocks gated in DPD (RCGCFG_STBY active-high: 0=gated) */
    /* CSRCCFG_STBY controls main clock sources only (FRO192M, PLLs, SXOSC etc.).
     * XOSC_32K and FRO_32K are VBAT_AON-domain clocks - they remain alive in DPD
     * regardless of CSRCCFG_STBY. Main clock sources are turned off in DPD. */
    socCfg.csrccfgStby = POWER_CSRCCFG_STBY_ALL_OFF;
    socCfg.pmucfgStby  = dpd_pmucfg.word;

    POWERCON_SetSocStandbyConfig(SYSCON__POWERCON_SOC_CTRL, &socCfg);

    /* 4. Apply wakeup sources (must be called even in DPD for IRQ masks). */
    POWER_ApplyWakeupSources();
    SYSCON__POWERCON_CMC0_CTRL->CMC_CTRL |= (POWERCON_CMC_CTRL_CMC_CTRL_SLEEP_HOLD_EN_MASK);

    /* 4b. PD_MEDIA is powered off in Deep Power Down: isolate and power off the MIPI PHY
     *     supply before WFI. No restore - wakeup triggers PoR. */
    POWER_MediaMipiPhyPowerOff();

    /* 5. Deep Power Down: enable all CMC internal standby flows (XMC_STBY_MASK = 0)
     *    and have every CMC trigger the SSC (explicit; also repairs the CMC0
     *    TRIGGER_SS clear left by a previous POWER_EnterSleep). No restore -
     *    wakeup is PoR. Then execute WFI. */
    POWERCON_SetXmcStandbyMask(SYSCON__POWERCON_GLOBAL, 0x00U);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC0_CTRL);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC1_CTRL);
    POWERCON_EnableSystemSleepTrigger(SYSCON__POWERCON_CMC2_CTRL);
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    __DSB();
    __WFI();
    __ISB();

    while (true) /* Should not reach here. */
    {
    }
}
